Revit 2027 API
FittingAngleUsage Enumeration
 An enumerated type representing the options for how to limit the angle values applicable to fitting content.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FittingAngleUsage
Public Enumeration FittingAngleUsage
public enum class FittingAngleUsage
type FittingAngleUsage
Members
Member name | Value | Description
UseAnAngleIncrement | 1 |  Uses the increment to determine the angle value.
UseAnyAngle | 0 |  Uses any angle supported by fitting content.
UseSpecificAngles | 2 |  Uses only the angles specified.
See Also
Reference
Autodesk.Revit.DB Namespace